# import tkinter
from tkinter import * # з бібліотеки tkinter імпортувати всі функції
# (щоб не писати tkinter.функція)
w = Tk() # створення пустого вікна
w.geometry("500x500+100+100") # розміри вікна. ширина, висота, відстань від лівого краю..
w.resizable(False, False) # можливість змінювати розміри вікна по горизонталі/вертикалі
l1 = Label(w, text="Hello\nworld", font="Arial 24", height=5)
l1.pack()
def bClick(): # функція що буде виконувати основну дію програми
    global l1, e1 # використовуючи поле введення та напис
    value = e1.get() # брать з поля введення вираз, що написав користувач
    answer = eval(value) # за допомогою автоматичного підрахунку eval рахуємо результат
    l1.config(text=answer) # змінюємо текст в напису на обраховану відповідь
b1 = Button(w, text="Press", command=bClick, font="Arial 24", width=10) # кнопка
# при створенні кнопки параметр command= прив'язує функцію до події нажаття на кнопку
b1.pack()
e1 = Entry(w, font="Arial 24", width=10) # створення поля введення
e1.pack(pady=10)
w.mainloop() # відмалювання вікна і підтримка його роботи
# (щоб не закрилось автоматично)