#  Задача 2. Показати трикутник в консолі висотою та шириною N(вводить користувач)
#  з незаповненим центром. Приклад: N = 5
#  *
#  **
#  *-*
#  *--*
#  *****

# Задача 3. Використовуючи вкладені цикли, написати програму що просить користувача
# ввести свою дату народження, та перевіряє правильність введення. (не можна вводити
# номера днів та місяців що неможливі та рік більший за 100 років назад). Якщо користувач
# ввів правильно, то привітати його та сказати скільки йому років.

# Задача 4. Користувач вводить числа N та M (ширина та висота прямокутника)
# Потім він вводить X та Y(номер стовпця та рядка що треба виділити). Використовуючи
# вкладені цикли програма має показати прямокутник в якому всі символи це '-' знаки
# мінуса, а у вказаних номерах стовпця та рядка будуть на всю висоту та ширину знак '@'.
# приклад N = 10 M = 5 X = 2 Y = 1:
# --@-------
# @@@@@@@@@@
# --@-------
# --@-------
# --@-------
