# Задча 1: Програма загадує число від 1 до 10. Користувач має вгадати число.
# Програма рахує кількість спроб користувача, та дає необмежену кількість спроб.
# Якщо користувач ввів число за межами можливих, спроба не зараховується та користувач
# має ввести знову.

import random as r

number = r.randint(1,10)
i = 0
print("Програма загадала число від 1 до 10. Спробуйте вгадать!")
while True:
    i += 1
    print("Спроба", i)
    a = int(input("Ваше число: "))
    while a < 1 or a > 10:
        print("Введіть правильне число з діапазону від 1 до 10!")
        a = int(input("Ваше число: "))
    if a == number:
        print("Правильно! Ви вгадали! Ваша кількість спроб:", i)
        break
    else:
        print("Не правильно!")