'''
Задача 2. Написати функцію, що приймає радіус кола та повертає його площу

Задача 3. Написати функцію, що приймає текст та повертає кількість цифр в цьому тексті

Задача 4. Написати функцію, що приймає текст та ключове слово, та повертає скільки
разів це слово зустрілося в тексті

Задача 5. Написати функцію, що приймає список і сортує його методом вставок повертаючи
відсортований масив

Задача 6. Написати функцію, що приймає текст, та виводить його в консолі в рамочці. Наприклад:
Введіть текст: "Мене звуть Саша"
*-----------------*
| Мене звуть Саша |
*-----------------*

'''