'''
Задача 7. Користувач вводить певний текст в консоль, програма має вивести
скільки слів в цьому тексті.

Задача 8. Користувач вводить певний текст в консоль, програма має порахувати
скільки символів не рахуючи пробіли та знаки пунктуації в цьому тексті

Задача 9. Користувач вводить своє ім'я, прізвище та по-батькові. Програма має
перевірити чи правильно їх написав користувач (з великої букви через пробіл)

Задача 10. Користувач вводить певний текст в консоль, програма має проаналізувати
текст та знайти кількість цифр в цьому тексті. Наприклад в тексті "Саша123 паша 12"
5 цифр.

Задача 11. Користувач пише велику кількість чисел через пробіл в консоль, програма зберігає
числа в текстовому форматі. Програма перетворює числа з тексту на числа і рахує їх сумму

Задача 12. Користувач вводить певний текст в консоль, програма має вивести
скільки унікальних символів в цьому тексті

Задача 13. Користувач вводить певний текст, програма розвертає кожне слово в тексті в
зворотньому порядку
'''
text2 = ""
text = "asdjkaskld asdasjlkd asj dksalj dksal dj"
for word in text.split(" "):
    word2 = ""
    for i in range(int(len(word))):
        word2 += word[len(word)-i-1]
    text2 += word2+" "
print(text2)