# Задача 1:
# Користувач вводить два числа. Програма в залежності від вибору коричтувача
# робить одну з 4 базових математичних дій (+,-,*,/) та виводить результат
a = int(input("Введіть перше число: "))
s = input("Введіть бажану дію(+,-,*,/): ")
b = int(input("Введіть друге число: "))
if s == "+":
    c = a + b
    print(f"{a} {s} {b} = {c}")
elif s == "-":
    c = a - b
    print(f"{a} {s} {b} = {c}")
elif s == "*":
    c = a * b
    print(f"{a} {s} {b} = {c}")
elif s == "/":
    if b == 0:
        print("На ноль ділити не можна")
    else:
        c = a / b
        print(f"{a} {s} {b} = {c}")
else:
    print("Такої дії не існує")
