# Задача 3: Пользователь вводит два числа (N) и (M). Програма делает прямоугольник
# из звездочек з высотой N и шириной M.

# Задача 4: Пользователь вводит число (A) и степень в которую нужно вознести
# это число A (p). Решить с помощью оператора поднятия в степень и попробовать циклом

# Задача 5: Пользователь вводит своё имя (name) и число (n), програма печатает
# это имя на екране, каждый раз увеличивая количество пробелов перед именем в
# каждой строке n строк.
# Пример:
# name: Sasha
# n: 3
# Sasha
#      Sasha
#           Sasha

# Задача 6: С помощью цикла сделать обратный отсчет в програме, где пользователь вводит
# числа. После каждого введенного числа програма пишет "Осталось {n} чисел" и просит ввести
# число снова. Всего 5 чисел.

#Задача 7. Пользователь вводит число n и m. Программа выводит прямоугольник
# в консоль по принципу (n) - высота прямоугольника, (m) - ширина прямоугольника,
# но прямоугольник не заполненный (рамочка не считается).
'''
Пример: 3х4
******
*----*
*----*
*----*
******
'''
