# функції (рекурсія, аргументи). словник (ключові слова)

# Задача 1. Створити функцію, що приймає будь-яку кількість аргументів та знаходить
# середнє значення між всіма числами

# - аргументи обов'язкові,
# - аргументи опціональні(аргументи зі значенням за замовчуванням)
# - аргументи спаковані у список (будь-яка кількість агрументів передана в одне місце)


def avrg(*args):
    sum = 0
    for arg in args:
        sum += arg
    return sum / len(args)


a = avrg(1, 3, 5.4, 7.1, 2, 1)
print(a)

